Documents/бит_РаспределениеАванса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_РаспределениеАванса</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХПоПериоду</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокУслугПоПериоду</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидНачисленияПоУслугамЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХПоПериоду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХПоПериоду</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидНачисленияПоУслугамЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПолучателиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПолучателиДенежныхСредств</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолучательДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВидНачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидНачисленияПоУслугамЖКХ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_РаспределениеАванса/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля
#КонецОбласти

#Область ЭкспортныеПроцедурыИФункцииДокумента
//+! Гаспирович В.В. Старая типовая процедура. не используется	
//Процедура ЗаполнитьСписокУслуг_стар(ЭтоЗакрытиеМесяца = Ложь) Экспорт
//	СписокУслугПоПериоду.Очистить();
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	 "ВЫБРАТЬ
//	 |	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет КАК ЛицевойСчет,
//	 |	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.УслугаЖКХ КАК УслугаЖКХ,
//	 |	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет.Здание КАК Здание,
//	 |	-бит_НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток КАК Аванс
//	 |ПОМЕСТИТЬ ВТ_ВсеАвансы
//	 |ИЗ
//	 |	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Остатки(
//	 |			&КонецПериода,
//	 |			Организация = &Организация
//	 |				И ВидНачисления = ЗНАЧЕНИЕ(Перечисление.бит_ВидНачисленияПоУслугамЖКХ.Аванс)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОстатки
//	 |ГДЕ
//	 |	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток < 0
//	 |
//	 |ИНДЕКСИРОВАТЬ ПО
//	 |	Здание
//	 |;
//	 |
//	 |////////////////////////////////////////////////////////////////////////////////
//	 |ВЫБРАТЬ
//	 |	ВТ_ВсеАвансы.ЛицевойСчет,
//	 |	ВТ_ВсеАвансы.УслугаЖКХ,
//	 |	бит_СписокЗданий.Улица КАК Улица,
//	 |	ВТ_ВсеАвансы.Здание КАК Здание,
//	 |	ВТ_ВсеАвансы.Аванс
//	 |ИЗ
//	 |	ВТ_ВсеАвансы КАК ВТ_ВсеАвансы
//	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
//	 |		ПО ВТ_ВсеАвансы.Здание = бит_СписокЗданий.Ссылка";
//	
//	Запрос.УстановитьПараметр("Организация", Организация);
//	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
//	
//	Если ЗначениеЗаполнено(Улица) Тогда
//		
//		Запрос.УстановитьПараметр("Улица", Улица);
//		Запрос.Текст = Запрос.Текст + "
//		|ГДЕ
//		|	бит_СписокЗданий.Улица = &Улица";
//		
//		Если ЗначениеЗаполнено(Здание) Тогда
//			Запрос.УстановитьПараметр("Здание", Здание);
//			Запрос.Текст = Запрос.Текст + "
//			|	И ВТ_ВсеАвансы.Здание = &Здание";
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Резульат = Запрос.Выполнить();
//	Если Резульат.Пустой() Тогда
//		
//		Если НЕ ЭтоЗакрытиеМесяца Тогда
//			ТекстСообщения = НСтр("ru = 'Для лицевых счетов, по заданному отбору, отсутствуют нераспределенные суммы аванса.'");
//			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
//		КонецЕсли;
//		
//		Возврат;
//	КонецЕсли;
//	
//	ТаблицаАвансов = Резульат.Выгрузить();
//		
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ТаблицаАвансов.ЛицевойСчет КАК ЛицевойСчет,
//	|	ТаблицаАвансов.УслугаЖКХ КАК УслугаЖКХ
//	|ПОМЕСТИТЬ ВТ_Авансы
//	|ИЗ
//	|	&ТаблицаАвансов КАК ТаблицаАвансов
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
//	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
//	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание КАК Здание,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание.Район КАК Район,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание.Участок КАК Участок,
//	|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств КАК ПолучательДенежныхСредств,
//	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
//	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
//	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
//	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
//	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
//	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь КАК ЖилаяПлощадь,
//	|	бит_СведенияОКвартиреСрезПоследних.МОП КАК МОП,
//	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь КАК ОтапливаемаяПлощадь,
//	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь КАК СовокупнаяПлощадь
//	|ПОМЕСТИТЬ ПоставщикиИУслуги
//	|ИЗ
//	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
//	|			&КонецПериода {(&КонецПериода)},
//	|			(ЛицевойСчет, Услуга) В
//	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|					ВТ_Авансы.ЛицевойСчет,
//	|					ВТ_Авансы.УслугаЖКХ
//	|				ИЗ
//	|					ВТ_Авансы)) КАК бит_СведенияПоУслугамЛССрезПоследних
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(&КонецПериода {(&КонецПериода)}, ) КАК бит_ПолучателиДенежныхСредствСрезПоследних
//	|		ПО бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_ПолучателиДенежныхСредствСрезПоследних.Услуга
//	|			И бит_СведенияПоУслугамЛССрезПоследних.Поставщик = бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&КонецПериода {(&КонецПериода)}, ) КАК бит_СведенияОКвартиреСрезПоследних
//	|		ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
//	|ГДЕ
//	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
//	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.УлицаЛицевогоСчета,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание.Район,
//	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание.Участок,
//	|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств,
//	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
//	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета,
//	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
//	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
//	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
//	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
//	|	бит_СведенияОКвартиреСрезПоследних.МОП,
//	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
//	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Период, МЕСЯЦ) КАК Период,
//	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК ЛицевойСчет,
//	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК УслугаЖКХ,
//	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ.Приоритет КАК Приоритет,
//	|	СУММА(ВЫБОР
//	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
//	|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
//	|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
//	|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
//	|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
//	|		КОНЕЦ) КАК Начисления,
//	|	СУММА(ВЫБОР
//	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
//	|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
//	|		КОНЕЦ) КАК Разовые,
//	|	СУММА(ВЫБОР
//	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
//	|				ТОГДА -бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
//	|		КОНЕЦ) КАК Оплата,
//	|	СУММА(ВЫБОР
//	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
//	|				ТОГДА -бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
//	|		КОНЕЦ) КАК Льгота,
//	|	СУММА(ВЫБОР
//	|			КОГДА (бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
//	|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
//	|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ)
//	|					И НЕ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ.ОбщедомовыеНачисления
//	|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
//	|		КОНЕЦ) КАК НачисленияИнд,
//	|	СУММА(ВЫБОР
//	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
//	|					ИЛИ (бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
//	|						ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
//	|						ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ)
//	|						И бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ.ОбщедомовыеНачисления
//	|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
//	|		КОНЕЦ) КАК НачисленияОбщеДом,
//	|	СУММА(ВЫБОР
//	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РасчетПредельногоИндекса
//	|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
//	|		КОНЕЦ) КАК СубсидияПИ
//	|ПОМЕСТИТЬ Обороты
//	|ИЗ
//	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Обороты(
//	|			&НачалоПериода {(&НачалоПериода)},
//	|			&КонецПериода {(&КонецПериода)},
//	|			Регистратор,
//	|			(ЛицевойСчет, УслугаЖКХ) В
//	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|						ПоставщикиИУслуги.ЛицевойСчет,
//	|						ПоставщикиИУслуги.Услуга
//	|					ИЗ
//	|						ПоставщикиИУслуги)
//	|				И Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Период, МЕСЯЦ),
//	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ,
//	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ.Приоритет,
//	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Период,
//	|	ЛицевойСчет,
//	|	УслугаЖКХ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериоду.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
//	|	бит_НачисленияПоУслугамЖКХПоПериоду.ЛицевойСчет КАК ЛицевойСчет,
//	|	бит_НачисленияПоУслугамЖКХПоПериоду.УслугаЖКХ КАК УслугаЖКХ,
//	|	СУММА(бит_НачисленияПоУслугамЖКХПоПериоду.Сумма) КАК СуммаОплаты
//	|ПОМЕСТИТЬ ОборотыОплата
//	|ИЗ
//	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду КАК бит_НачисленияПоУслугамЖКХПоПериоду
//	|ГДЕ
//	|	(бит_НачисленияПоУслугамЖКХПоПериоду.Регистратор ССЫЛКА Документ.бит_ОплатаКУ ИЛИ бит_НачисленияПоУслугамЖКХПоПериоду.Регистратор ССЫЛКА Документ.бит_РаспределениеАванса)
//	|	И бит_НачисленияПоУслугамЖКХПоПериоду.Период <= &КонецПериода
//	|	И бит_НачисленияПоУслугамЖКХПоПериоду.ПериодВзаиморасчетов МЕЖДУ &НачалоПериода И &КонецПериода
//	|	И бит_НачисленияПоУслугамЖКХПоПериоду.ЛицевойСчет В
//	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|				ПоставщикиИУслуги.ЛицевойСчет
//	|			ИЗ
//	|				ПоставщикиИУслуги)
//	|	И бит_НачисленияПоУслугамЖКХПоПериоду.УслугаЖКХ В
//	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|				ПоставщикиИУслуги.Услуга
//	|			ИЗ
//	|				ПоставщикиИУслуги)
//	|	И бит_НачисленияПоУслугамЖКХПоПериоду.Организация = &Организация
//	|	И НЕ бит_НачисленияПоУслугамЖКХПоПериоду.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.бит_ВидНачисленияПоУслугамЖКХ.Аванс)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериоду.ПериодВзаиморасчетов, МЕСЯЦ),
//	|	бит_НачисленияПоУслугамЖКХПоПериоду.УслугаЖКХ,
//	|	бит_НачисленияПоУслугамЖКХПоПериоду.ЛицевойСчет
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ПериодВзаиморасчетов,
//	|	ЛицевойСчет,
//	|	УслугаЖКХ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Обороты.ЛицевойСчет КАК ЛицевойСчет,
//	|	Обороты.Период КАК Период,
//	|	Обороты.УслугаЖКХ КАК УслугаЖКХ,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(Обороты.Начисления, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ЕСТЬNULL(Обороты.Льгота, 0) - ЕСТЬNULL(Обороты.СубсидияПИ, 0) - ЕСТЬNULL(ОборотыОплата.СуммаОплаты, 0) > 0
//	|			ТОГДА ЕСТЬNULL(Обороты.Начисления, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ЕСТЬNULL(Обороты.Льгота, 0) - ЕСТЬNULL(Обороты.СубсидияПИ, 0) - ЕСТЬNULL(ОборотыОплата.СуммаОплаты, 0)
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК СуммаКОплате
//	|ИЗ
//	|	Обороты КАК Обороты
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыОплата КАК ОборотыОплата
//	|		ПО Обороты.Период = ОборотыОплата.ПериодВзаиморасчетов
//	|			И Обороты.ЛицевойСчет = ОборотыОплата.ЛицевойСчет
//	|			И Обороты.УслугаЖКХ = ОборотыОплата.УслугаЖКХ
//	|ГДЕ
//	|	ВЫБОР
//	|			КОГДА ЕСТЬNULL(Обороты.Начисления, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ЕСТЬNULL(Обороты.Льгота, 0) - ЕСТЬNULL(Обороты.СубсидияПИ, 0) - ЕСТЬNULL(ОборотыОплата.СуммаОплаты, 0) > 0
//	|				ТОГДА ЕСТЬNULL(Обороты.Начисления, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ЕСТЬNULL(Обороты.Льгота, 0) - ЕСТЬNULL(Обороты.СубсидияПИ, 0) - ЕСТЬNULL(ОборотыОплата.СуммаОплаты, 0)
//	|			ИНАЧЕ 0
//	|		КОНЕЦ > 0
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Период";
//	
//	Запрос.УстановитьПараметр("Организация", Организация);
//	Запрос.УстановитьПараметр("НачалоПериода", Дата('00010101'));
//	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
//	запрос.УстановитьПараметр("ТаблицаАвансов", ТаблицаАвансов);
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		
//		// Находим аванс по услуге.
//		Отбор = Новый Структура;
//		Отбор.Вставить("ЛицевойСчет", Выборка.ЛицевойСчет);
//		Отбор.Вставить("УслугаЖКХ",	  Выборка.УслугаЖКХ);
//		
//		МассивСтрок = ТаблицаАвансов.НайтиСтроки(Отбор);
//		
//		Если МассивСтрок.Количество() > 0 Тогда
//			Если МассивСтрок[0].Аванс > 0 Тогда
//				НСтр = СписокУслугПоПериоду.Добавить();
//				НСтр.ЛицевойСчет		  = Выборка.ЛицевойСчет;
//				НСтр.Услуга				  = Выборка.УслугаЖКХ;
//				НСтр.ПериодВзаиморасчетов = Выборка.Период;
//				НСтр.Сумма				  = Мин(МассивСтрок[0].Аванс, Выборка.СуммаКОплате);
//				
//				// Списываем распределенный аванс.
//				НСтрАвансов = ТаблицаАвансов.Добавить();
//				НСтрАвансов.ЛицевойСчет = Выборка.ЛицевойСчет;
//				НСтрАвансов.УслугаЖКХ	= Выборка.УслугаЖКХ;
//				НСтрАвансов.Аванс	    = -Мин(МассивСтрок[0].Аванс, Выборка.СуммаКОплате);
//				
//				ТаблицаАвансов.Свернуть("ЛицевойСчет,УслугаЖКХ","Аванс");
//				
//			КонецЕсли;
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	СуммаДокумента = СписокУслугПоПериоду.Итог("Сумма");
//	
//КонецПроцедуры

Процедура ЗаполнитьСписокУслуг(ЭтоЗакрытиеМесяца = Ложь) Экспорт
	
	СписокУслугПоПериоду.Очистить();
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.УслугаЖКХ КАК УслугаЖКХ,
		|	-бит_НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток КАК СуммаОстатокАванса
		|ПОМЕСТИТЬ вт01_ОстаткиАвансов
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Остатки(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И ЛицевойСчет.Здание = &Здание
		|				И ЛицевойСчет.УлицаЛицевогоСчета = &УлицаЛицевогоСчета
		|				И ВидНачисления = &ВидНачисленияАванс) КАК бит_НачисленияПоУслугамЖКХПоПериодуОстатки
		|ГДЕ
		|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт01_ОстаткиАвансов.ЛицевойСчет КАК ЛицевойСчет,
		|	вт01_ОстаткиАвансов.УслугаЖКХ КАК УслугаЖКХ,
		|	МАКСИМУМ(вт01_ОстаткиАвансов.СуммаОстатокАванса) КАК СуммаОстатокАванса,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
		|	СУММА(ЕСТЬNULL(бит_НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток, 0)) КАК СуммаОстаток
		|ИЗ
		|	вт01_ОстаткиАвансов КАК вт01_ОстаткиАвансов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Остатки(
		|				&КонецПериода,
		|				Организация = &Организация
		|					И ЛицевойСчет.Здание = &Здание
		|					И ЛицевойСчет.УлицаЛицевогоСчета = &УлицаЛицевогоСчета
		|					И ЛицевойСчет В
		|						(ВЫБРАТЬ
		|							вт01_ОстаткиАвансов.ЛицевойСчет КАК ЛицевойСчет
		|						ИЗ
		|							вт01_ОстаткиАвансов КАК вт01_ОстаткиАвансов)
		|					И ВидНачисления = ЗНАЧЕНИЕ(перечисление.бит_ВидНачисленияПоУслугамЖКХ.пустаяСсылка)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОстатки
		|		ПО вт01_ОстаткиАвансов.ЛицевойСчет = бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет
		|			И вт01_ОстаткиАвансов.УслугаЖКХ = бит_НачисленияПоУслугамЖКХПоПериодуОстатки.УслугаЖКХ
		|ГДЕ
		|	ЕСТЬNULL(бит_НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток, 0) <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	вт01_ОстаткиАвансов.ЛицевойСчет,
		|	вт01_ОстаткиАвансов.УслугаЖКХ,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ПериодВзаиморасчетов
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет,
		|	УслугаЖКХ,
		|	ПериодВзаиморасчетов
		|ИТОГИ ПО
		|	ЛицевойСчет,
		|	УслугаЖКХ";
	
	Запрос.УстановитьПараметр("ВидНачисленияАванс", Перечисления.бит_ВидНачисленияПоУслугамЖКХ.Аванс);
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("КонецПериода", новый Граница(КонецМесяца(Дата)+1,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("УлицаЛицевогоСчета", Улица);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЛицевойСчет = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЛицевойСчет.Следующий() Цикл
		ВыборкаУслугаЖКХ = ВыборкаЛицевойСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаУслугаЖКХ.Следующий() Цикл
			ВыборкаДетальныеЗаписи = ВыборкаУслугаЖКХ.Выбрать();
			СуммаАвансаКРаспределению =ВыборкаУслугаЖКХ.СуммаОстатокАванса; 
			Пока ВыборкаДетальныеЗаписи.Следующий() и СуммаАвансаКРаспределению>0 Цикл
				Cписываем = мин(СуммаАвансаКРаспределению,ВыборкаДетальныеЗаписи.СуммаОстаток);
				НСтр = СписокУслугПоПериоду.Добавить();
				НСтр.ЛицевойСчет		  = ВыборкаЛицевойСчет.ЛицевойСчет;
				НСтр.Услуга				  = ВыборкаУслугаЖКХ.УслугаЖКХ;
				НСтр.ПериодВзаиморасчетов = ВыборкаДетальныеЗаписи.ПериодВзаиморасчетов;
				НСтр.Сумма				  = Cписываем;
				СуммаАвансаКРаспределению=СуммаАвансаКРаспределению-Cписываем;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСписокУслугВводНачальных(ЛицевыеСчета) Экспорт
	
	СписокУслугПоПериоду.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет КАК ЛицевойСчет,
	 |	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.УслугаЖКХ КАК УслугаЖКХ,
	 |	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет.Здание КАК Здание,
	 |	-бит_НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток КАК Аванс
	 |ПОМЕСТИТЬ ВТ_ВсеАвансы
	 |ИЗ
	 |	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Остатки(
	 |			&КонецПериода,
	 |			Организация = &Организация
	 |				И ВидНачисления = ЗНАЧЕНИЕ(Перечисление.бит_ВидНачисленияПоУслугамЖКХ.Аванс)
	 |				И ЛицевойСчет В (&ЛицевыеСчета)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОстатки
	 |ГДЕ
	 |	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток < 0
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	Здание
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_ВсеАвансы.ЛицевойСчет,
	 |	ВТ_ВсеАвансы.УслугаЖКХ,
	 |	бит_СписокЗданий.Улица КАК Улица,
	 |	ВТ_ВсеАвансы.Здание КАК Здание,
	 |	ВТ_ВсеАвансы.Аванс
	 |ИЗ
	 |	ВТ_ВсеАвансы КАК ВТ_ВсеАвансы
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	 |		ПО ВТ_ВсеАвансы.Здание = бит_СписокЗданий.Ссылка";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЛицевыеСчета", ЛицевыеСчета);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	
	Если ЗначениеЗаполнено(Улица) Тогда
		
		Запрос.УстановитьПараметр("Улица", Улица);
		Запрос.Текст = Запрос.Текст + "
		|ГДЕ
		|	бит_СписокЗданий.Улица = &Улица";
		
		Если ЗначениеЗаполнено(Здание) Тогда
			Запрос.УстановитьПараметр("Здание", Здание);
			Запрос.Текст = Запрос.Текст + "
			|	И ВТ_ВсеАвансы.Здание = &Здание";
		КонецЕсли;
		
	КонецЕсли;
	
	Резульат = Запрос.Выполнить();
	Если Резульат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаАвансов = Резульат.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаАвансов.ЛицевойСчет КАК ЛицевойСчет,
	|	ТаблицаАвансов.УслугаЖКХ КАК УслугаЖКХ
	|ПОМЕСТИТЬ ВТ_Авансы
	|ИЗ
	|	&ТаблицаАвансов КАК ТаблицаАвансов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание КАК Здание,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание.Район КАК Район,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание.Участок КАК Участок,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств КАК ПолучательДенежныхСредств,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь КАК ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.МОП КАК МОП,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь КАК ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь КАК СовокупнаяПлощадь
	|ПОМЕСТИТЬ ПоставщикиИУслуги
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&КонецПериода {(&КонецПериода)},
	|			(ЛицевойСчет, Услуга) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ_Авансы.ЛицевойСчет,
	|					ВТ_Авансы.УслугаЖКХ
	|				ИЗ
	|					ВТ_Авансы)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(&КонецПериода {(&КонецПериода)}, ) КАК бит_ПолучателиДенежныхСредствСрезПоследних
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.Услуга = бит_ПолучателиДенежныхСредствСрезПоследних.Услуга
	|			И бит_СведенияПоУслугамЛССрезПоследних.Поставщик = бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&КонецПериода {(&КонецПериода)}, ) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.УлицаЛицевогоСчета,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание.Район,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Здание.Участок,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.МОП,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Период, МЕСЯЦ) КАК Период,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ.Приоритет КАК Приоритет,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ
	|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
	|		КОНЕЦ) КАК Начисления,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
	|		КОНЕЦ) КАК Разовые,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА -бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
	|		КОНЕЦ) КАК Оплата,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеЛьготПоЛицевымСчетам
	|				ТОГДА -бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
	|		КОНЕЦ) КАК Льгота,
	|	СУММА(ВЫБОР
	|			КОГДА (бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|					ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ)
	|					И НЕ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ.ОбщедомовыеНачисления
	|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
	|		КОНЕЦ) КАК НачисленияИнд,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
	|					ИЛИ (бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
	|						ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
	|						ИЛИ бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ВводНачальныхОстатковПоКУ)
	|						И бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ.ОбщедомовыеНачисления
	|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
	|		КОНЕЦ) КАК НачисленияОбщеДом,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РасчетПредельногоИндекса
	|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
	|		КОНЕЦ) КАК СубсидияПИ
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Обороты(
	|			&НачалоПериода {(&НачалоПериода)},
	|			&КонецПериода {(&КонецПериода)},
	|			Регистратор,
	|			(ЛицевойСчет, УслугаЖКХ) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ПоставщикиИУслуги.ЛицевойСчет,
	|						ПоставщикиИУслуги.Услуга
	|					ИЗ
	|						ПоставщикиИУслуги)
	|				И Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Период, МЕСЯЦ),
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ.Приоритет,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериоду.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
	|	бит_НачисленияПоУслугамЖКХПоПериоду.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХПоПериоду.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(бит_НачисленияПоУслугамЖКХПоПериоду.Сумма) КАК СуммаОплаты
	|ПОМЕСТИТЬ ОборотыОплата
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду КАК бит_НачисленияПоУслугамЖКХПоПериоду
	|ГДЕ
	|	(бит_НачисленияПоУслугамЖКХПоПериоду.Регистратор ССЫЛКА Документ.бит_ОплатаКУ ИЛИ бит_НачисленияПоУслугамЖКХПоПериоду.Регистратор ССЫЛКА Документ.бит_РаспределениеАванса)
	|	И бит_НачисленияПоУслугамЖКХПоПериоду.Период <= &КонецПериода
	|	И бит_НачисленияПоУслугамЖКХПоПериоду.ПериодВзаиморасчетов МЕЖДУ &НачалоПериода И &КонецПериода
	|	И бит_НачисленияПоУслугамЖКХПоПериоду.ЛицевойСчет В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ПоставщикиИУслуги.ЛицевойСчет
	|			ИЗ
	|				ПоставщикиИУслуги)
	|	И бит_НачисленияПоУслугамЖКХПоПериоду.УслугаЖКХ В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ПоставщикиИУслуги.Услуга
	|			ИЗ
	|				ПоставщикиИУслуги)
	|	И бит_НачисленияПоУслугамЖКХПоПериоду.Организация = &Организация
	|	И НЕ бит_НачисленияПоУслугамЖКХПоПериоду.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.бит_ВидНачисленияПоУслугамЖКХ.Аванс)
	|
	|СГРУППИРОВАТЬ ПО
	|	КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериоду.ПериодВзаиморасчетов, МЕСЯЦ),
	|	бит_НачисленияПоУслугамЖКХПоПериоду.УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХПоПериоду.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПериодВзаиморасчетов,
	|	ЛицевойСчет,
	|	УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обороты.ЛицевойСчет КАК ЛицевойСчет,
	|	Обороты.Период КАК Период,
	|	Обороты.УслугаЖКХ КАК УслугаЖКХ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Обороты.Начисления, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ЕСТЬNULL(Обороты.Льгота, 0) - ЕСТЬNULL(Обороты.СубсидияПИ, 0) - ЕСТЬNULL(ОборотыОплата.СуммаОплаты, 0) > 0
	|			ТОГДА ЕСТЬNULL(Обороты.Начисления, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ЕСТЬNULL(Обороты.Льгота, 0) - ЕСТЬNULL(Обороты.СубсидияПИ, 0) - ЕСТЬNULL(ОборотыОплата.СуммаОплаты, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаКОплате
	|ИЗ
	|	Обороты КАК Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыОплата КАК ОборотыОплата
	|		ПО Обороты.Период = ОборотыОплата.ПериодВзаиморасчетов
	|			И Обороты.ЛицевойСчет = ОборотыОплата.ЛицевойСчет
	|			И Обороты.УслугаЖКХ = ОборотыОплата.УслугаЖКХ
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(Обороты.Начисления, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ЕСТЬNULL(Обороты.Льгота, 0) - ЕСТЬNULL(Обороты.СубсидияПИ, 0) - ЕСТЬNULL(ОборотыОплата.СуммаОплаты, 0) > 0
	|				ТОГДА ЕСТЬNULL(Обороты.Начисления, 0) + ЕСТЬNULL(Обороты.Разовые, 0) - ЕСТЬNULL(Обороты.Льгота, 0) - ЕСТЬNULL(Обороты.СубсидияПИ, 0) - ЕСТЬNULL(ОборотыОплата.СуммаОплаты, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", Дата('00010101'));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	запрос.УстановитьПараметр("ТаблицаАвансов", ТаблицаАвансов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// Находим аванс по услуге.
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет", Выборка.ЛицевойСчет);
		Отбор.Вставить("УслугаЖКХ",	  Выборка.УслугаЖКХ);
		
		МассивСтрок = ТаблицаАвансов.НайтиСтроки(Отбор);
		
		Если МассивСтрок.Количество() > 0 Тогда
			Если МассивСтрок[0].Аванс > 0 Тогда
				НСтр = СписокУслугПоПериоду.Добавить();
				НСтр.ЛицевойСчет		  = Выборка.ЛицевойСчет;
				НСтр.Услуга				  = Выборка.УслугаЖКХ;
				НСтр.ПериодВзаиморасчетов = Выборка.Период;
				НСтр.Сумма				  = Мин(МассивСтрок[0].Аванс, Выборка.СуммаКОплате);
				
				// Списываем распределенный аванс.
				НСтрАвансов = ТаблицаАвансов.Добавить();
				НСтрАвансов.ЛицевойСчет = Выборка.ЛицевойСчет;
				НСтрАвансов.УслугаЖКХ	= Выборка.УслугаЖКХ;
				НСтрАвансов.Аванс	    = -Мин(МассивСтрок[0].Аванс, Выборка.СуммаКОплате);
				
				ТаблицаАвансов.Свернуть("ЛицевойСчет,УслугаЖКХ","Аванс");
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	СуммаДокумента = СписокУслугПоПериоду.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область ОбеспечениеПроведенияДокумента


// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или.
// Заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить.
	ОбязательныеРеквизитыШапки = "Организация, Ответственный";
		
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры

// Выполняет движения по регистрам. 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента)
	
	ДатаДока = Дата;
	НачислениеПоУслПоПериоду = Движения.бит_НачисленияПоУслугамЖКХПоПериоду;
	
	Для каждого СтрокаТЧ Из СписокУслугПоПериоду Цикл
		Если СтрокаТЧ.Сумма <> 0 тогда	

			// Списание аванса.
			ДвижениеУслПоПериоду			 		  = НачислениеПоУслПоПериоду.Добавить();
			ДвижениеУслПоПериоду.ВидДвижения		  = ВидДвиженияНакопления.Приход;
			ДвижениеУслПоПериоду.Период				  = ДатаДока;
			ДвижениеУслПоПериоду.ЛицевойСчет		  = СтрокаТЧ.ЛицевойСчет;
			ДвижениеУслПоПериоду.УслугаЖКХ			  = СтрокаТЧ.Услуга;
			ДвижениеУслПоПериоду.Сумма				  = СтрокаТЧ.Сумма;
			ДвижениеУслПоПериоду.Организация		  = СтруктураШапкиДокумента.Организация;
			ДвижениеУслПоПериоду.ВидНачисления		  = Перечисления.бит_ВидНачисленияПоУслугамЖКХ.Аванс;
			
			// Погашение начислений.
			ДвижениеУслПоПериоду			 		  = НачислениеПоУслПоПериоду.Добавить();
			ДвижениеУслПоПериоду.ВидДвижения		  = ВидДвиженияНакопления.Расход;
			ДвижениеУслПоПериоду.Период				  = ДатаДока;
			ДвижениеУслПоПериоду.ПериодВзаиморасчетов = СтрокаТЧ.ПериодВзаиморасчетов;
			ДвижениеУслПоПериоду.ЛицевойСчет		  = СтрокаТЧ.ЛицевойСчет;
			ДвижениеУслПоПериоду.УслугаЖКХ			  = СтрокаТЧ.Услуга;
			ДвижениеУслПоПериоду.Сумма				  = СтрокаТЧ.Сумма;
			ДвижениеУслПоПериоду.Организация		  = СтруктураШапкиДокумента.Организация;
			
		КонецЕсли; 	
	КонецЦикла;
	НачислениеПоУслПоПериоду.Записывать  = Истина;
	
КонецПроцедуры

// Функция выполняет проверку на повторное закрытие месяца.
//
Функция ПроверкаПовторовДокументов()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоМесяца" ,НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецМесяца"  ,КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация"  ,Организация);
	Запрос.УстановитьПараметр("Улица"        ,Улица);
	Запрос.УстановитьПараметр("Здание"       ,Здание);
	Запрос.УстановитьПараметр("Ссылка"       ,Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_РаспределениеАванса.Ссылка,
	|	бит_РаспределениеАванса.Проведен,
	|	бит_РаспределениеАванса.Организация,
	|	бит_РаспределениеАванса.Улица,
	|	бит_РаспределениеАванса.Здание,
	|	бит_РаспределениеАванса.Дата
	|ИЗ
	|	Документ.бит_РаспределениеАванса КАК бит_РаспределениеАванса
	|ГДЕ
	|	бит_РаспределениеАванса.Организация = &Организация
	|	И бит_РаспределениеАванса.Дата >= &НачалоМесяца
	|	И бит_РаспределениеАванса.Дата <= &КонецМесяца
	|	И НЕ бит_РаспределениеАванса.ПометкаУдаления
	|	И (бит_РаспределениеАванса.Здание = &Здание
	|			ИЛИ (бит_РаспределениеАванса.Улица = &Улица
	|				И бит_РаспределениеАванса.Здание = ЗНАЧЕНИЕ(Справочник.бит_СписокЗданий.ПустаяСсылка)))
	|	И бит_РаспределениеАванса.Ссылка <> &Ссылка";
	
	Результат = Запрос.Выполнить();
	
	ТекстСообщения = "";
	Если Не Результат.Пустой() тогда
		ТекстСообщения = ТекстСообщения + "Документ в данном месяц уже создан.";
	КонецЕсли;
	Возврат ТекстСообщения;
	
Конецфункции

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если СписокУслугПоПериоду.Количество() = 0 Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Не заполнена табличная часть документа.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СообщенияОповторахВидовОпераций = ПроверкаПовторовДокументов();
	Если ЗначениеЗаполнено(СообщенияОповторахВидовОпераций) Тогда
		ТекстСообщения = СообщенияОповторахВидовОпераций;  
		ОтказДо = Отказ;
		бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(ЭтотОбъект));
		Отказ = ОтказДо;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СтрНайти(Комментарий, "Документ создан автоматически") > 0 Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Улица"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
